// Задание 1. Вывести квадрат числа
/*/int value = 5;
Console.Write("Квадрат числа = " + value*value);/*/
Console.Write("Введите целое число: ");
int value = Convert.ToInt32(Console.ReadLine());
int kvadrat_value = value * value;
Console.Write("Квадрат числа = " + kvadrat_value);